export default defineEventHandler(async (event) => {
  return {
    code: 200,
    content: {
      北京总部: [
        {
          lat: 37.0902,
          lon: -95.7129,
          tel: '86 - 10 - 82881666',
          address: '北京市海淀区丰豪东路9号中关村集成电路设计园8号楼',
          邮政编码: '100094',
          // 可以接到百度地图上
          href: '#',
        },
      ],
      上海: [
        {
          lat: 35.8617,
          lon: 104.1954,
          tel: '86 - 10 - 82881666',
          address: '上海市长宁区兆益科技园区天山路18号603室',
          邮政编码: '100094',
          // 可以接到百度地图上
          href: '#',
        },
        {
          lat: 35.8617,
          lon: 104.1554,
          tel: '86 - 10 - 82881666',
          address: '上海市浦东新区张江路505号15层',
          邮政编码: '100094',
          // 可以接到百度地图上
          href: '#',
        },
      ],
      印度: [
        {
          lat: 20.5937,
          lon: 78.9629,
          tel: '86 - 10 - 82881666',
          address: '上海市浦东新区张江路505号15层',
          邮政编码: '100094',
          // 可以接到百度地图上
          href: '#',
        },
      ],
    },
  };
});
